package p1

fun main() {
    println("Integer - он служит для представления целых чисел, ограниченного" +
            " минимальным и максимальным значением, которые зависят от выделенной под число памяти.")
    println("String - это тип данных, значениями которого могут быть произвольные последовательности (строки) символов алфавита." +
            "\n\t\t Все переменные данного типа (строковые переменные) могут быть представлены фиксированным числом байтов или обладать произвольной длиной.")
    println("Character - тип данных, предназначенный для хранения одного символа (управляющего или печатного) в определённой кодировке.")
    println("Boolean -  это примитивный тип данных в информатике, принимающий два возможных значения: истина (true) и ложь (false).")
    println("Float - Это фундаментальный тип данных, встроенный в компилятор, \n\t\tкоторый используется для определения числовых значений с плавающей десятичной запятой.")
}